* BMF MODULE MASTER PRESORT
* KEY IS EIN / MFT / TAX PERIOD.  ALL MERGE STEPS ASSUME THIS ORDER.
* EIN     001-009
* MFT     010-011
* TXPD    012-017
  SORT FIELDS=(1,9,CH,A,10,2,CH,A,12,6,CH,A)
  OPTION EQUALS,DYNALLOC=(SYSDA,4)
  END
