* TRANSACTION FILE PRESORT
* KEY IS EIN / MFT / TAX PERIOD / TRANSACTION CODE.
* TC IS CARRIED IN THE KEY SO 650 POSTS AHEAD OF 660 WITHIN A MODULE.
* EIN     001-009
* MFT     010-011
* TXPD    012-017
* TC      018-020
  SORT FIELDS=(1,9,CH,A,10,2,CH,A,12,6,CH,A,18,3,CH,A)
  OMIT COND=(18,3,CH,EQ,C'000')
  OPTION EQUALS,DYNALLOC=(SYSDA,4)
  END
