* SSA W-2 TOTALS PRESORT FOR THE CAWR MATCH
* EIN     001-009
* TAX YR  010-013
* WAGE    014-026
* WHLD    027-039
* DOCCNT  040-044
* MOST RECENT TAX YEAR FIRST PER RCC-3319.
  SORT FIELDS=(1,9,CH,A,10,4,CH,D)
  INCLUDE COND=(40,5,ZD,GT,+0)
  OPTION EQUALS,DYNALLOC=(SYSDA,2)
  END
