      *****************************************************************
      *    PENALTY WORK AREA - COMMON TO FTD/FTF/FTP ROUTINES         *
      *****************************************************************
       01  PEN-WK.
           05  PW-RT                   PIC S9(01)V9(04) COMP-3.
           05  PW-BAS                  PIC S9(11)V99 COMP-3.
           05  PW-AMT                  PIC S9(09)V99 COMP-3.
           05  PW-ACC                  PIC S9(09)V99 COMP-3.
           05  PW-DLQ                  PIC S9(05) COMP-3.
           05  PW-MO                   PIC S9(03) COMP-3.
           05  PW-TIER                 PIC 9(01).
           05  PW-CAP                  PIC S9(09)V99 COMP-3.
           05  PW-SW                   PIC X(01).
           05  PW-RC                   PIC 9(02).
