//BMFALOC  JOB (ACCT,BMF),'ALLOCATE BMF FILES',CLASS=A,
//             MSGCLASS=X,MSGLEVEL=(1,1),REGION=1024K,
//             NOTIFY=&SYSUID
//*
//* ONE TIME SETUP.  ALLOCATES THE NON GENERATION DATASETS AND LOADS
//* THE FIXED REFERENCE FILES.  DELETE IS TOLERATED ON A FIRST RUN.
//*
//DEL      EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE TAX.BMF.ENTITY.MASTER
  DELETE TAX.SSA.W2.TOTALS
  DELETE TAX.FMS.DEBTS
  DELETE TAX.BMF.CTLLIB
  SET MAXCC = 0
//*
//ALOC     EXEC PGM=IDCAMS,COND=(4,LT)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  ALLOCATE DSNAME(TAX.BMF.ENTITY.MASTER)     -
           NEW CATALOG UNIT(SYSDA)           -
           SPACE(50 10) CYLINDERS            -
           RECFM(F B) LRECL(150) DSORG(PS)
  ALLOCATE DSNAME(TAX.SSA.W2.TOTALS)         -
           NEW CATALOG UNIT(SYSDA)           -
           SPACE(10 5) CYLINDERS             -
           RECFM(F B) LRECL(44) DSORG(PS)
  ALLOCATE DSNAME(TAX.FMS.DEBTS)             -
           NEW CATALOG UNIT(SYSDA)           -
           SPACE(5 5) CYLINDERS              -
           RECFM(F B) LRECL(80) DSORG(PS)
  ALLOCATE DSNAME(TAX.BMF.CTLLIB)            -
           NEW CATALOG UNIT(SYSDA)           -
           SPACE(2 1) CYLINDERS DIR(10)      -
           RECFM(F B) LRECL(80) DSORG(PO)
//*
//* PRIME THE FIRST GENERATION OF THE MODULE MASTER SO THAT STEP 020
//* HAS A (0) TO READ ON THE VERY FIRST CYCLE.
//*
//PRIME    EXEC PGM=IEBGENER,COND=(4,LT)
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DUMMY,DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)
//SYSUT2   DD DSN=TAX.BMF.MODULE(+1),
//             DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)
//SYSIN    DD DUMMY
//*
