//BMFSTEP  PROC PGM=,RGN=4096K
//*
//*  CATALOGUED PROCEDURE FOR THE BMF NIGHTLY CYCLE.
//*  SYMBOLIC PGM IS SUPPLIED BY THE INVOKING EXEC.
//*
//GO       EXEC PGM=&PGM,REGION=&RGN,COND=(4,LT)
//STEPLIB  DD DSN=TAX.BMF.LOADLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=D
//         PEND
